{ 
        "homepage": "https://forum.civa.jp/viewtopic.php?f=3&t=44", 
        "serverMultiple": "1",
        "promos": { 
                "1.12.2-latest": "1.7.1",
                "1.16.1-latest": "1.7.1"
        }, 
        "1.16.1": {
                "1.7": "軽微なプログラム修正、1.16.1に対応\nMinor program modifications, support for 1.16.1",
                "1.7.1": "表示設定の変更\nChanging display settings"
        },
        "1.12.2": {
                "1.6.4": "回復したネクサスポイント表示の追加、/dadoコマンド実行時にネクサスに関する情報を更新するように変更、一部の設定が反映されないバグを修正\nAdded the recovered nexus points display, changed to update nexus information when executing /dado command, fixed a bug where some settings were not reflected.",
                "1.6.5": "チームによって文字の色を変える設定を有効にした時に保存が出来なかったバグを修正\nFixed a bug that could not be saved when changing the color of text by team is enabled.",
                "1.6.6": "アップデート通知機能の追加\nUpdate notification function added.",
                "1.6.7": "チャットでもアップデート通知をするように変更\nChanged to provide update notifications in chat as well.",
                "1.6.8": "Ping表示の追加\nAdded the Ping display.",
                "1.6.9": "ランクポイントを取得したときに必要なランクポイント表示も更新するように変更\nChanged to update the required rank point display when you get a rank point.",
                "1.6.10": "/rankコマンド実行時に現在のランクが正しく認識されないバグを修正\nFixed a bug where the current rank is not recognized correctly when executing the /rank command.",
                "1.7": "軽微なプログラム修正、1.16.1に対応\nMinor program modifications, support for 1.16.1",
                "1.7.1": "表示設定の変更\nChanging display settings"
        }, 
        "1.12": {
                "1.6": "現在の職業が反映されないバグを修正\nFixed a bug where the current job is not reflected.\n対応バージョンを1.12.xのみに変更\nChanged the supported version to 1.12.x only.",
                "1.6.1": "使えない機能があったバグを修正\nFixed a bug that prevented some features from working.",
                "1.6.2": "/killコマンドを実行したときもデス数にカウントされていたバグを修正\nFixed a bug where the death count was also counted when executing the /kill command.",
                "1.6.3": "ネクサスダメージがカウントされないバグを修正\nFixed a bug where nexus damage was not counted.\n対応バージョンを1.12.2のみに変更\nChanged the supported version to 1.12.2 only."
        },
        "1.10.2": {
                "1.0": "MODをリリース\nMOD is released.",
                "1.1": "設定用GUIの追加、虹色の隠しコードの廃止、いらない機能の削除\nAdded GUI for configuration, removed hidden code for rainbow colors, and removed unnecessary functions.",
                "1.2": "ランク表示の追加、色の設定のバグを修正\nAdded the rank display, fixed a bug in the color setting.", 
                "1.2.1": "FPS表示の追加、バグ修正\nAdded the FPS display, fixed bugs.",
                "1.3": "ネクサスダメージ表示を試験的に追加\nAdded the nexus damage display on a trial basis.",
                "1.4": "所属チームの表示、チームによって文字の色を変える機能の追加\nAdded the team's name display and the ability to change the color of the text depending on the team.\n1.11~1.12.xに対応\nCompatible with 1.11~1.12.x",
                "1.4.1": "表示処理の最適化\nOptimizing the display process.",
                "1.5": "ネクサスキル、防衛キル表示の追加、取得XPが反映されないバグを修正\nAdded the Nexus kill and Defense kill display, fixed a bug that did not reflect XP acquisition.\nJavaの対応バージョンを7から8に変更\nChanged the support version of Java from 7 to 8.",
                "1.5.1": "簡易的なCPS表示を追加\nAdded the simple CPS display.",
                "1.5.2": "CPSカウンターの精度を改善\nImproved accuracy of CPS counters.",
                "1.5.3": "/rankコマンド実行時にランク表示を更新するように変更\nChanged to update the rank display when the /rank command is executed.",
                "1.5.4": "ネクサスダメージが更新されないバグを修正\nFixed a bug that prevented nexus damage from being updated."
        }
} 